fonecmid-diplom/src/Documents/ВКМ_ОбслуживаниеКлиента/ВКМ_ОбслуживаниеКлиента.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВКМ_ОбслуживаниеКлиента</name>
  <registerRecords>AccumulationRegister.ВКМ_ВыполненныеКлиентуРаботы</registerRecords>
  <attributes>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>Специалист</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПроведенияРабот</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяНачалаРаботПлан</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяОкончанияРаботПлан</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеПроблемы</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаЧасовКОплатеПоДокументу</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ВыполненныеРаботы</name>
    <attributes>
      <name>ОписаниеРабот</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ФактическиПотраченоЧасов</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЧасыКОплатеКлиенту</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

fonecmid-diplom/src/AccumulationRegisters/ВКМ_ВыполненныеКлиентуРаботы/ВКМ_ВыполненныеКлиентуРаботы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ВКМ_ВыполненныеКлиентуРаботы</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>КоличествоЧасов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаКОплате</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

fonecmid-diplom/src/Enums/ВидыДоговоровКонтрагентов/ВидыДоговоровКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыДоговоровКонтрагентов</name>
  <enumValues>
    <name>Поставщик</name>
  </enumValues>
  <enumValues>
    <name>Покупатель</name>
  </enumValues>
  <enumValues>
    <name>ВКМ_АбонентскоеОбслуживание</name>
  </enumValues>
</mdclass:Enum>

fonecmid-diplom/src/Catalogs/ДоговорыКонтрагентов/ДоговорыКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ДоговорыКонтрагентов</name>
  <owners>Catalog.Контрагенты</owners>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидДоговора</name>
    <type>
      <types>EnumRef.ВидыДоговоровКонтрагентов</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ВКМ_ДополнительныеРеквизиты</name>
    <attributes>
      <name>Реквизит</name>
      <type>
        <types>CatalogRef.ВКМ_ДополнтительныеРеквизиты</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Date</types>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

fonecmid-diplom/src/Catalogs/ВКМ_ДополнтительныеРеквизиты/ВКМ_ДополнтительныеРеквизиты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВКМ_ДополнтительныеРеквизиты</name>
  <predefined>
    <items>
      <name>ДатаНачалаДействияДоговора</name>
      <description>Дата начала действия договора</description>
    </items>
    <items>
      <name>ДатаОкончанияДействияДоговора</name>
      <description>Дата окончания действия договора</description>
    </items>
    <items>
      <name>ЕжемесячнаяАбонентскаяПлата</name>
      <description>Ежемесячная абонентская плата</description>
    </items>
    <items>
      <name>СтоимостьЧасаРаботыСпециалиста</name>
      <description>Стоимость часа работы специалиста</description>
    </items>
  </predefined>
  <attributes>
    <name>ТипРеквизита</name>
    <type>
      <types>EnumRef.ВКМ_ТипыДополнительныхРеквизитов</types>
    </type>
  </attributes>
</mdclass:Catalog>

fonecmid-diplom/src/Documents/ВКМ_ОбслуживаниеКлиента/ObjectModule.bsl
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	СуммаЧасовКОплатеПоДокументу = ВыполненныеРаботы.Итог("ЧасыКОплатеКлиенту");	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ,Режим)
	
	// регистр ВКМ_ВыполненныеКлиентуРаботы
	
		Запрос = Новый Запрос;
	
	
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ДоговорыКонтрагентовВКМ_ДополнительныеРеквизиты.Ссылка КАК Ссылка,
		|	ДоговорыКонтрагентовВКМ_ДополнительныеРеквизиты.Значение КАК СтоимостьЧаса
		|ПОМЕСТИТЬ ВТ_СтоимостьЧаса
		|ИЗ
		|	Справочник.ДоговорыКонтрагентов.ВКМ_ДополнительныеРеквизиты КАК ДоговорыКонтрагентовВКМ_ДополнительныеРеквизиты
		|ГДЕ
		|	ДоговорыКонтрагентовВКМ_ДополнительныеРеквизиты.Реквизит = ЗНАЧЕНИЕ(Справочник.ВКМ_ДополнтительныеРеквизиты.СтоимостьЧасаРаботыСпециалиста)
		|	И ДоговорыКонтрагентовВКМ_ДополнительныеРеквизиты.Ссылка = &СсылкаДоговор
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДоговорыКонтрагентовВКМ_ДополнительныеРеквизиты.Значение КАК НачалоДоговора,
		|	ДоговорыКонтрагентовВКМ_ДополнительныеРеквизиты.Ссылка КАК Ссылка
		|ПОМЕСТИТЬ ВТ_ДатаНачалаДоговора
		|ИЗ
		|	Справочник.ДоговорыКонтрагентов.ВКМ_ДополнительныеРеквизиты КАК ДоговорыКонтрагентовВКМ_ДополнительныеРеквизиты
		|ГДЕ
		|	ДоговорыКонтрагентовВКМ_ДополнительныеРеквизиты.Реквизит = ЗНАЧЕНИЕ(Справочник.ВКМ_ДополнтительныеРеквизиты.ДатаНачалаДействияДоговора)
		|	И ДоговорыКонтрагентовВКМ_ДополнительныеРеквизиты.Ссылка = &СсылкаДоговор
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДоговорыКонтрагентовВКМ_ДополнительныеРеквизиты.Значение КАК ОкончаниеДоговора,
		|	ДоговорыКонтрагентовВКМ_ДополнительныеРеквизиты.Ссылка КАК Ссылка
		|ПОМЕСТИТЬ ВТ_ДатаОкончанияДоговора
		|ИЗ
		|	Справочник.ДоговорыКонтрагентов.ВКМ_ДополнительныеРеквизиты КАК ДоговорыКонтрагентовВКМ_ДополнительныеРеквизиты
		|ГДЕ
		|	ДоговорыКонтрагентовВКМ_ДополнительныеРеквизиты.Реквизит = ЗНАЧЕНИЕ(Справочник.ВКМ_ДополнтительныеРеквизиты.ДатаОкончанияДействияДоговора)
		|	И ДоговорыКонтрагентовВКМ_ДополнительныеРеквизиты.Ссылка = &СсылкаДоговор
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВКМ_ОбслуживаниеКлиента.Договор КАК Договор,
		|	ВКМ_ОбслуживаниеКлиента.Договор.Представление КАК ДоговорПредставление,
		|	ВКМ_ОбслуживаниеКлиента.Клиент КАК Клиент,
		|	ВКМ_ОбслуживаниеКлиента.СуммаЧасовКОплатеПоДокументу КАК КоличествоЧасов,
		|	ВКМ_ОбслуживаниеКлиента.Дата КАК Период,
		|	ВКМ_ОбслуживаниеКлиента.Договор.ВидДоговора КАК ВидДоговора,
		|	ВТ_ДатаНачалаДоговора.НачалоДоговора КАК НачалоДоговора,
		|	ВТ_ДатаОкончанияДоговора.ОкончаниеДоговора КАК ОкончаниеДоговора,
		|	ЕСТЬNULL(ВТ_СтоимостьЧаса.СтоимостьЧаса, 0) КАК СтоимостьЧаса
		|ИЗ
		|	Документ.ВКМ_ОбслуживаниеКлиента КАК ВКМ_ОбслуживаниеКлиента
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ДатаНачалаДоговора КАК ВТ_ДатаНачалаДоговора
		|		ПО ВКМ_ОбслуживаниеКлиента.Договор.Ссылка = ВТ_ДатаНачалаДоговора.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ДатаОкончанияДоговора КАК ВТ_ДатаОкончанияДоговора
		|		ПО ВКМ_ОбслуживаниеКлиента.Договор.Ссылка = ВТ_ДатаОкончанияДоговора.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СтоимостьЧаса КАК ВТ_СтоимостьЧаса
		|		ПО ВКМ_ОбслуживаниеКлиента.Договор.Ссылка = ВТ_СтоимостьЧаса.Ссылка
		|ГДЕ
		|	ВКМ_ОбслуживаниеКлиента.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("СсылкаДоговор", Договор);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Движения.ВКМ_ВыполненныеКлиентуРаботы.Записывать = Истина;
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда		
		ПроверитьДанныеДокумента(ВыборкаДетальныеЗаписи,Отказ);
		Если Не Отказ Тогда
			Движение = Движения.ВКМ_ВыполненныеКлиентуРаботы.Добавить();
			ЗаполнитьЗначенияСвойств(Движение,ВыборкаДетальныеЗаписи);
			Движение.СуммаКОплате = Движение.КоличествоЧасов * ВыборкаДетальныеЗаписи.СтоимостьЧаса;
		КонецЕсли;
	КонецЕсли;
	
	
//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	//Данный фрагмент построен конструктором.
	//При повторном использовании конструктора, внесенные вручную данные будут утеряны!
	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры

Процедура ПроверитьДанныеДокумента(ВыборкаДетальныеЗаписи,Отказ)
	Если Не ВыборкаДетальныеЗаписи.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание Тогда
			ТекстСообщения = СтрШаблон("Договор %1 имеет вид отличный от Абонентское обслуживание. Выберите договор с корректным видом.",ВыборкаДетальныеЗаписи.ДоговорПредставление);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
			Отказ = Истина;
			Возврат;
		КонецЕсли;
		
		Если ВыборкаДетальныеЗаписи.СтоимостьЧаса = 0 Тогда
			ТекстСообщения = СтрШаблон("По договору %1 не установлена стоимость часа работы специалиста.",ВыборкаДетальныеЗаписи.ДоговорПредставление);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
			Отказ = Истина;
			Возврат;
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.НачалоДоговора) Тогда
			ТекстСообщения = СтрШаблон("По договору %1 не установлена дата начала действия договора.",ВыборкаДетальныеЗаписи.ДоговорПредставление);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
			Отказ = Истина;
			Возврат;
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.ОкончаниеДоговора) Тогда
			ТекстСообщения = СтрШаблон("По договору %1 не установлена дата окончания действия договора.",ВыборкаДетальныеЗаписи.ДоговорПредставление);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
			Отказ = Истина;
			Возврат;
		КонецЕсли;
		
		ДатаДокументаВДиапазоне = (Дата >= ВыборкаДетальныеЗаписи.НачалоДоговора И Дата <= КонецДня(ВыборкаДетальныеЗаписи.ОкончаниеДоговора));
		
		Если Не ДатаДокументаВДиапазоне Тогда
			ТекстСообщения = СтрШаблон("Дата документа %1 находится вне диапазона действия договора %2 с %3 по %4.",
				Формат(Дата,"ДФ=dd.MM.yyyy;"),
				ВыборкаДетальныеЗаписи.ДоговорПредставление,
				Формат(ВыборкаДетальныеЗаписи.НачалоДоговора,"ДФ=dd.MM.yyyy;"),
				Формат(ВыборкаДетальныеЗаписи.ОкончаниеДоговора,"ДФ=dd.MM.yyyy;"));
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
			Отказ = Истина;
			Возврат;
		КонецЕсли;
		
КонецПроцедуры
